slides/2013-02-01-Lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2013-02-01-Lab</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2013-02-01-Lab"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-01 11:00:14 PST"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2013-02-01-Lab</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Lab: Obtain and Explore Data</a></li>
<li><a href="#sec-2">2 Why GitHub?</a></li>
<li><a href="#sec-3">3 Setup GitHub account</a></li>
<li><a href="#sec-4">4 Setup git repository on ischool server</a></li>
<li><a href="#sec-5">5 Connect it to GitHub</a></li>
<li><a href="#sec-6">6 Share with us</a></li>
<li><a href="#sec-7">7 Obtain Data</a></li>
<li><a href="#sec-8">8 Questions</a></li>
<li><a href="#sec-9">9 Submit Homework</a>
<ul>
<li><a href="#sec-9-1">9.1 Pull Requests</a></li>
</ul>
</li>
<li><a href="#sec-10">10 Going Forward</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lab: Obtain and Explore Data &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Setup GitHub account
</li>
<li>Find a data set or external API
</li>
<li>Superficially examine it
</li>
<li>Summarize findings
</li>
<li>Submit assignment via GitHub
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Why GitHub? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li><code>git</code> tool is standard in industry
</li>
<li>GitHub provides best tools for sharing, commenting code
</li>
<li>This assignment will not have code, just practice submitting
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Setup GitHub account &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Create a <a href="https://github.com/signup/free">GitHub Account</a>, making sure to
    use your .edu address
</li>
<li>Use <a href="https://github.com/edu">GitHub/Edu</a> to request a free micro plan:
    these let us use private accounts
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Setup git repository on ischool server &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>On the server ischool.berkeley.edu
</li>
</ul>




<pre class="src src-bash">$ git clone git://github.com/jblomo/datamining290.git
</pre>

<ul>
<li>On the server, in the datamining290 directory run 
</li>
</ul>




<pre class="src src-bash">$ git remote rename origin jblomo
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Connect it to GitHub &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>After you recieve your free micro account on GitHub, create a private repository called datamining290
</li>
<li>It will provide you with an SSH git path, let's call it PATH
</li>
<li>On the server, in the datamining290 directory, run
</li>
</ul>




<pre class="src src-html">$ git remote add origin PATH
$ git push origin
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Share with us &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>Hopefully you now have a private copy of my repository
</li>
<li>Add Shreyas and me (users: seekshreyas, jblomo) as a contributor to your private repository
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Obtain Data &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>Look through the links in slides for interesting data sets, or find your own
</li>
<li>Or find a service API, like NYTimes
</li>
<li>Explore the data available to answer the following questions
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Questions &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>What are the types of data available to you?
</li>
<li>For data sets: how many records are in the data set?
</li>
<li>For API: what are the limits on fetching data?
</li>
<li>Provide an "interesting" record, explain its properties and why it is
    interesting
</li>
<li>What are 3 questions you could answer using your data?
</li>
</ul>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Submit Homework &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-9">

<ul>
<li>On the ischool server, create a branch called <code>hw-obtain-data</code>
</li>
<li>Create a text file to write the solution, a simple editor to use is <code>pico</code>
</li>
<li><code>git add</code> the file
</li>
<li><code>git commit</code> the change
</li>
<li><code>git push origin</code> to put it on GitHub
</li>
<li>on github, submit a "pull request" from the <code>hw-obtain-data</code> branch to your master branch
</li>
</ul>


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Pull Requests &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-9-1">

<ul>
<li>Pull requests are a way of showing updates in a way that lets me provide
     comments, get notifications
</li>
<li>This is the first time I've tried it for class, so you're on the cutting
     edge. Hopefully it will work, give me feedback if it is not
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Going Forward &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-10">

<ul>
<li>Other homework assignments will be completing code
</li>
<li>General work-flow:
<ul>
<li>Start a new branch
</li>
<li>Add required files
</li>
<li>push to GitHub
</li>
<li>Submit Pull Request
</li>
</ul>

</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-01 11:00:14 PST</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
